Revit 2027 API
RebarCoupler.RotationAngle Property
 Indetifies the rotation angle of the coupler around its axis.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RotationAngle { get; set; }
Public Property RotationAngle As Double
	Get
	Set
public:
property double RotationAngle {
	double get ();
	void set (double value);
}
member RotationAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  The rotation parameter cannot be set or get for Self-Orienting rebar coupler families ( rebar coupler families with FAMILY_SELF_ORIENTING parameter = 1 ).
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace